// =====================================================================================================================

// Task 1

// Последнее значение = 1. После этого при следующей проверке в условии будет 0 (false) и цикл прекратится

// =====================================================================================================================

// Task 2

// let A = 1;
// let B = 2;
// let C = 3;
//
// if (B > A && B < C) {
//     A *= 2;
//     B *= 2;
//     C *= 2;
// } else {
//     A *= -1;
//     B *= -1;
//     C *= -1;
// }
//
// console.log(`A = ${A}; B = ${B}; C = ${C};`);

// =====================================================================================================================

// Task 3

// let A = 3;
// let B = 2;
// let C = 1;
//
// if (B > A && B < C || B > A && B > C) {
//     A *= 2;
//     B *= 2;
//     C *= 2;
// } else {
//     A *= -1;
//     B *= -1;
//     C *= -1;
// }
//
// console.log(`A = ${A}; B = ${B}; C = ${C};`);

// =====================================================================================================================

// Task 4

// let A = 4;
// let B = 7;
// let C = 2;
// const AtoB = Math.abs(A - B);
// const AtoC = Math.abs(A - C);
//
// if (AtoB == AtoC) {
//     console.log('Одинаковое расстояние');
// } else if (AtoB < AtoC) {
//     console.log(`B: ${AtoB}`);
// } else {
//     console.log(`C: ${AtoC}`);
// }

// =====================================================================================================================

// Task 5

// let x = 1;
// let y = 0;
//
// if (x === 0 && y === 0) {
//     console.log(0);
// } else if ( x !== 0 && y === 0) {
//     console.log(1);
// } else if ( x === 0 && y !== 0) {
//     console.log(2);
// } else {
//     console.log(3);
// }

// =====================================================================================================================

// Task 6

// let x = 1;
// let y = 1;
//
// if (x > 0 && y > 0) {
//     console.log('1');
// } else if ( x < 0 && y > 0) {
//     console.log('2');
// } else if ( x < 0 && y < 0) {
//     console.log('3');
// } else if ( x > 0 && y < 0) {
//     console.log('4');
// }

// =====================================================================================================================

// Task 7

// const x1 = 2;
// const y1 = 3;
//
// const x2 = -2;
// const y2 = 3;
//
// const x3 = -2;
// const y3 = -3;
//
// let x4, y4;
//
// if (x1 === x2) {
//     x4 = x3;
// } else if (x1 === x3) {
//     x4 = x2;
// } else {
//     x4 = x1;
// }
//
// if (y1 === y2) {
//     y4 = y3;
// } else if (y1 === y3) {
//     y4 = y2;
// } else {
//     y4 = y1;
// }
//
// console.log(`x4: ${x4}, y4: ${y4}`);

// =====================================================================================================================

// Task 8

// const year = 2000;
//
// if (year % 4 === 0) {
//     if (year % 100 === 0 && year % 400 !== 0){
//         console.log('365');
//     } else {
//         console.log('366');
//     }
// } else {
//     console.log('365');
// }

// =====================================================================================================================

// Task 9

// const number = 142;
// let sign = number > 0 ? 'положительное' : 'отрицательное';
// let oddOrEven = number % 2 === 0 ? 'четное' : 'нечетное';
// let resultedString = number !== 0 ? `${sign} ${oddOrEven} число` : 'нулевое число';
//
// console.log(resultedString);

// =====================================================================================================================

// Task 10

// const number = 123;
//
// if (number > 0 && number < 1000) {
//     let lengthString = '';
//     const lengthNumber = String(number).length;
//     const oddOrEven = number % 2 === 0 ? 'четное' : 'нечетное';
//
//     if (lengthNumber === 3) {
//         lengthString = ' трехзначное';
//     } else if (lengthNumber === 2) {
//         lengthString = ' двухзначное';
//     }
//
//     console.log(`${oddOrEven}${lengthString} число`);
// }

// =====================================================================================================================

// Task 11

// Первый выведет 1,2,3,4 - итерация закончиться на числе 4 потому, что добавление происходит перед проверкой условия условием
// Второй выведет 1,2,3,4,5

// =====================================================================================================================

// Task 12

// Вывод будет одинаковым потому, что опперация с i происходит после тела цикла
// Первый выведет 0,1,2,3,4
// Второй выведет 0,1,2,3,4

// =====================================================================================================================

// Task 13

// for (let number = 2; number <= 10; number++) {
//     if (number % 2 === 0)  console.log(number);
// }

// =====================================================================================================================

// Task 14

// let i = 0;
// while (i < 3){
//     alert( `number ${i}!` );
//     i++;
// }

// =====================================================================================================================

// Task 15

// let result = 0;
//
// do {
//     result = prompt("Введите число больше 100");
// } while (result < 100 && result != null);

// =====================================================================================================================

// Task 16

// let max = 20;
//
// for (let i = 2; i < max; i++) {
//     let isSimple = true;
//
//     if (i == 2) {
//         console.log(i);
//         continue;
//     }
//
//     for (let j = 2; j <= i; j++) {
//         if (Number.isInteger(i / j)) {
//             isSimple = false;
//             break;
//         }
//     }
//
//     if (isSimple) console.log(i);
// }

// let min = 2;
// const max = 10;
//
// for (min; i < max; min++) {
//     let f = 0;
//
//     for (let k = 1; k <= min; k++) {
//         if (i % k == 0) {
//             f++;
//         }
//     }
//     if (f == 2) {
//         console.log(min);
//     }
//
//     f = 0;
// }

// =====================================================================================================================

// Task 17

// let first = +prompt('Первое число');
// let second = +prompt('Второе число');
//
// console.log(((first + second) / 2).toFixed(1));

// =====================================================================================================================

// Task 18

// let number = +prompt('Введите число');
//
// console.log(number * number);

// =====================================================================================================================

// Task 19

// let result1 = +prompt("Первое число");
// let result2 = +prompt("Второе число");
// let result3 = +prompt("Третее число");
//
// console.log(Math.max(result1, result2, result3) - Math.min(result1, result2, result3));

// =====================================================================================================================

// Task 20

// let result = +prompt("Введите число");
//
// if (result % 2 == 0) {
//     console.log("четное");
// } else {
//     console.log("нечетное");
// }

// =====================================================================================================================

// Task 21

// const number = 2152;
// const length = String(number).length;
// let sum = 0;
//
// for (let i = 0; i < length; i++) {
//     sum += +String(number).substr(i, 1);
// }
// console.log(`Сумма: ${sum}, Количество: ${length}`);

// =====================================================================================================================

// Task 22

// let action = +prompt("Дюймы в сантиметры - введите 1. Сантиметры в дюймы - введите 2");
// let number = +prompt("Введите число");
//
// if (action == 1) {
//     console.log(number + ' дюйм = ' + number * 2.54 + ' см');
// } else if (action == 2) {
//     console.log(number + ' см = ' + (number / 2.54).toFixed(2) + ' дюйм');
// }

// =====================================================================================================================

// Task 23

// let number = +prompt("Введите число от 100 до 999" );
// let result = 0;
//
// if (number > 99 && number < 1000) {
//     if (number % 2 == 0){
//         for (let i = 0; i < 3; i++) {
//             result += +String(number).substr(i, 1);
//             console.log(result);
//         }
//
//         console.log(`Сумма: ${result}`);
//     } else {
//         result = 1;
//
//         for (let i = 0; i < 3; i++) {
//             result *= +String(number).substr(i, 1);
//         }
//
//         console.log(`Произведение: ${result}`);
//     }
// }

// =====================================================================================================================

// Task 24

// let side1 = +prompt("Первая сторона треугольника");
// let side2 = +prompt("Вторая сторона треугольника");
// let side3 = +prompt("Третья сторона треугольника");
//
// if (side1 + side2 > side3 && side2 + side3 > side1 && side1 + side3 > side2) {
//     console.log("такой треугольник существует");
// } else {
//     console.log("такой треугольник не существует");
// }

// =====================================================================================================================

// Task 25

// let x = 4 ;
// let y = 9;
// let r = 10;
//
// if (Math.sqrt(x ** 2 + y ** 2) > r){
//     console.log("За пределами круга");
// } else {
//     console.log("Принадлежит кругу");
// }

// =====================================================================================================================

// Task 26

// let user = {};
//
// user.name = 'John';
// user.surname = 'Smith';
// user.name = 'Pete';
// delete user.name;

// =====================================================================================================================

// Task 27

// Можно (Мы не переопределяем хранящийся в константе объект, а всего лишь мутируем его. Это бы не сработало, если бы в константе находился примитивный тип данных)

// =====================================================================================================================

// Task 28

// let sum = 0;
// let salaries = {
//     John: 100,
//     Ann: 160,
//     Pete: 130
// }
//
// for (let salary of Object.values(salaries)) {
//     sum += salary;
// }
//
// console.log(sum);

// =====================================================================================================================

// Task 29

// Из-за неточности при операциях с плавающей точкой у нас никогда не получиться 10 без дополнительных окрулгений